{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert/distilbert-base-uncased",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "distilbert.transformer.layer.1.ffn.lin2",
    "distilbert.transformer.layer.5.ffn.lin2",
    "distilbert.transformer.layer.3.ffn.lin1",
    "distilbert.transformer.layer.1.ffn.lin1",
    "distilbert.transformer.layer.0.ffn.lin1",
    "distilbert.transformer.layer.4.ffn.lin1",
    "distilbert.transformer.layer.0.ffn.lin2",
    "distilbert.transformer.layer.3.ffn.lin2",
    "distilbert.transformer.layer.4.ffn.lin2",
    "distilbert.transformer.layer.2.ffn.lin1",
    "distilbert.transformer.layer.2.ffn.lin2",
    "distilbert.transformer.layer.5.ffn.lin1"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}