{
  "_name_or_path": "distilbert/distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForMaskedLM"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "blog11518",
    "1": "blog25872",
    "2": "obama",
    "3": "fitzgerald",
    "4": "hemingway",
    "5": "woolf",
    "6": "bush",
    "7": "blog30102",
    "8": "blog5546",
    "9": "trump",
    "10": "blog30407",
    "11": "qq",
    "12": "pp",
    "13": "h"
  },
  "initializer_range": 0.02,
  "label2id": {
    "blog11518": 0,
    "blog25872": 1,
    "blog30102": 7,
    "blog30407": 10,
    "blog5546": 8,
    "bush": 6,
    "fitzgerald": 3,
    "h": 13,
    "hemingway": 4,
    "obama": 2,
    "pp": 12,
    "qq": 11,
    "trump": 9,
    "woolf": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": null,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.44.1",
  "vocab_size": 30522
}
